import 'package:app/generated/i18n.dart';
import 'package:app/widgets/app_bar.dart';
import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:flutter_translate/flutter_translate.dart';
import 'package:html/dom.dart' as dom;

class PrivacyStatementPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.transparent,
      appBar: MyAppBar(
        centerTitle: translate('privacy_protocol_title'),
        backgroundColor: Colors.transparent,
      ),
      body: _buildUserServiceRichText(),
    );
  }

  Widget _buildUserServiceRichText() {
    return Container(
        width: ScreenUtil.instance.setWidth(85),
        height: ScreenUtil.instance.setHeight(130),
        margin: EdgeInsets.only(left: ScreenUtil().setWidth(2.5), top: ScreenUtil.instance.setHeight(2), bottom: 0),
        child: SingleChildScrollView(
          child: RichText(
              text: TextSpan(children: <TextSpan>[
            TextSpan(
              text: """尊敬的CASHBOX钱包APP用户：
              
       我们对《CASHBOX钱包APP用户隐私政策》进行了更新。此版本《CASHBOX钱包APP户隐私政策》将逐一说明每项功能可能收集的个人信息目的、范围、方式；我们如何保护您的个人信息。""",
              style: TextStyle(
                color: Colors.white,
                fontSize: ScreenUtil.instance.setSp(3),
                fontStyle: FontStyle.normal,
              ),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """【特别提示】
       请您仔细阅读《CASHBOX钱包APP隐私政策》（尤其是加粗划线的内容）详细了解我们对信息的收集、使用、保存方式等，并确定了解我们对您个人信息的处理规则，以便您对我们的服务作出适当的选择。本隐私政策中涉及的相关术语，我们尽量以简明扼要的表述，以便您更好地理解。您使用或在我们更新本隐私政策后（我们会及时提示您更新的情况）继续使用我们的产品与/或服务，即表示您同意本隐私政策（含更新版本）内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。
       阅读过程中，如您有任何疑问，您可随时发送邮件至： CASHBOX@scry.info与我们取得联系。如您不同意政策中的任何条款，您应立即停止使用CASHBOX钱包APP软件。 """,
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """引言
       CASHBOX钱包APP重视用户信息安全与隐私保护，竭尽全力通过合理有效的信息安全技术及管理流程，防止您的信息泄露、损毁、丢失；为您提供便利的信息管理选项，增强您对信息管理的便捷性；保护您的通信秘密，保障您的信息及通信安全。CASHBOX钱包APP严格遵守法律法规，仅收集必要的信息，并提升信息处理透明度，在产品或服务开发的各个环节，综合法律、产品、设计等多方因素，融入隐私保护的理念，为您提供更加安全、可靠的服务。
       我们制定并遵循本《CASHBOX钱包APP用户隐私政策》（以下简称“本政策”），主要向您说明：
       • 我们收集哪些信息；
       
       • 我们收集信息的用途；
       
       • 我们如何共享、转让、公开披露您的个人信息；
       
       • 我们如何保存您的个人信息；
       
       • 您如何管理个人信息；
       
       • 未成年人个人信息保护
       
       • 通知和修订
       
       • 如何联系我们 """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """一、个人信息的定义与范围

除另有约定外，本政策所用术语具有以下定义。

1.1个人信息：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息。本隐私政策中涉及的个人信息包括自然人的姓名、昵称、出生日期、国籍、身份证件号码、性别、年龄、个人生物识别信息、住址、电话号码、公司、机构、职业。

1.2 个人敏感信息：是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。例如，个人敏感信息包括身份证件号码、个人生物识别信息、银行账号、通信内容、健康生理信息等。故您应自行谨慎判断确定相关数字资产及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。 

1.3 匿名化处理后的信息，即通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后不能被复原的信息，匿名化处理后的信息不属于个人信息。

1.4 其他无法识别特定自然人身份或者反映特定自然人活动情况的信息不属于个人信息。 

除上述定义外，本政策所用其他术语与《CASHBOX钱包APP用户服务协议》中的术语具有相同的涵义。如您有问题，请联系我们。
          """,
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """二、我们收集的信息

2.1 CASHBOX钱包是基于区块链开发的数字资产钱包，包括其他为方便用户使用区块链系统而开发的辅助工具。CASHBOX钱包APP所收集的个人信息具体包括：

2.1.1在您使用本软件时，或访问本软件时，本软件自动接收并记录的用户浏览器上的服务器数值，包括您所使用的设备型号、地理位置IP地址等数据及您要求取用的网页记录；

2.1.2软件收集到的您在平台进行交易的有关数据，包括您创建与导入的钱包地址、转入和转出记录；

2.1.3本软件收集的其他您的个人信息会以明确说明的方式提醒您注意并征得您的同意。

2.2 我们可能会获得您在使用第三方合作伙伴服务时所产生或分享的信息。包括：您使用CASHBOX钱包帐户登录第三方合作伙伴服务时，或者您使用第三方合作伙伴服务账户登录CASHBOX钱包时，我们会获得您登录第三方合作伙伴服务的名称、登录时间或登录CASHBOX钱包的登录时间，方便您进行授权管理。请您仔细阅读第三方合作伙伴服务的用户协议或隐私政策。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """三、我们如何使用收集的信息

我们严格遵守法律法规的规定及与用户的约定，将收集的信息用于以下用途。若我们超出以下用途使用您的信息，我们将再次向您进行说明，并征得您的同意。 

3.1 向您提供服务。

3.2 满足您的个性化需求。例如，语言设定、位置设定、个性化的帮助服务。

3.3 产品开发和服务优化。例如，当我们的系统发生故障时，我们会记录和分析系统故障时产生的信息，优化我们的服务。

3.4 安全保障。例如，我们会将您的信息用于身份验证、安全防范、反诈骗监测、存档备份、客户的安全服务等用途。您下载或安装的安全软件会对恶意程序或病毒进行检测，或为您识别诈骗信息。

3.5 评估、改善我们的广告投放和其他促销及推广活动的效果。

3.6 管理软件。例如，进行软件认证、软件升级等。

3.7 邀请您参与有关我们服务的调查。

为了让您有更好的体验、改善我们的服务或经您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某些服务所收集的信息用于我们的其他服务。例如，将您在使用我们某项服务时的信息，用于另一项服务中向您展示个性化的内容或广告、用于用户研究分析与统计等服务。 为了确保服务的安全，帮助我们更好地了解我们应用程序的运行情况，我们可能记录相关信息，例如，您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。我们不会将我们存储在分析软件中的信息与您在应用程序中提供的个人身份信息相结合。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """四、我们如何共享、转让、公开披露您的信息

4.1我们将遵守相关法律法规，对您的个人信息予以保密。除以下情况外，我们不会向其他人共享您的个人信息：

A. 只有共享您的个人信息，才能提供您所需要的服务。

B. 为了提升我们的产品及服务质量或向您提供全新的产品及服务，我们会在关联公司内部共享您的相关信息。

C. 您通过CASHBOX钱包软件使用第三方服务时，CASHBOX钱包会按照“个人信息的收集”条款列明的共享内容与提供服务的第三方共享您的个人信息。

D. 为维护用户合法权益，在协助处理与您有关的纠纷或争议时，我们可能向与您存在利害关系的第三方提供解决纠纷或争议所必需的信息。

E. 根据法律规定，刑事侦查机关为调查犯罪，依法定程序调取的必要个人信息，或行政机关、司法机构，依法定程序并经您授权同意调取的必要个人信息。

F. 在法律要求或允许的范围内，为了保护社会公共利益、财产或安全而提供必要的信息。

G. 另行获得您的明确同意或授权。

4.2非经法定程序或获得您的同意，我们不会将您的个人信息提供给任何第三方机构或个人。对我们与之共享个人信息的公司、组织和个人，我们会与之签署严格的保密协议，要求他们按照我们的说明、本隐私政策及其他任何相关的保密和安全措施来处理个人信息。

4.3我们将遵守相关法律法规，对您的个人信息予以保密。除非事先获得您的明确同意或授权，或依照法律规定所必须，我们不会公开披露您的个人信息。

4.4另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：

A. 与国家安全、国防安全直接相关的；

B. 与公共安全、公共卫生、重大公共利益直接相关的；

C. 与犯罪侦查、起诉、审判和判决执行等直接相关的；

D. 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

E. 个人信息主体自行向社会公众公开的个人信息；

F. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。

4.5如发生收购、兼并、重组等变更，我们会要求变更后的主体依然遵守本隐私政策约定，履行原有责任及义务。如变更后的主体需变更个人信息使用目的，我们会要求其事先获得您的明示同意。对内而言，在前述的收购、兼并活动中，对于被收购、被兼并对象管理的数据(包括用户数据)均采用与CASHBOX钱包自有数据相同的标准和要求进行处理和保护。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """五、我们如何保护您的个人信息

我们为您的信息提供相应的安全保障，以防止信息的丢失、不当使用、未经授权访问或披露。 

5.1我们严格遵守法律法规保护用户的通信秘密。 

5.2我们将在合理的安全水平内使用各种安全保护措施以保障信息的安全。例如，我们使用加密技术（例如，TLS、SSL）、匿名化处理等手段来保护您的个人信息。 

5.3我们建立专门的管理制度、流程和组织确保信息安全。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务，并进行审查。 

5.4若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大，并以推送通知、公告等形式告知您。

5.5 我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本隐私政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。

5.6 互联网并非绝对安全的环境，而且电子邮件、即时通讯、社交软件等与其他用户的交流方式无法确定是否完全加密，我们建议您使用此类工具时请使用复杂密码，并注意保护您的个人信息安全。

5.7 互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """六、我们如何保存您的个人信息

6.1 我们实施妥善的实物、电子、管理及技术方面的措施来保护和保障您的个人资料的安全。我们尽力确保通过我们平台所搜集的任何个人资料皆免于任何与我们无关的第三者的滋扰。我们采取的安全措施包括但不限于：

6.1.1 实物措施：存有您个人资料的记录会被存放在有锁的地方。

6.1.2电子措施：存有您个人资料的电脑数据会被存放在受严格登入限制的电脑系统和存储媒体上。

6.1.3管理措施：我们内部设立有对用户信息进行安全保护的相关部门，并建立了相关内控制度，对可能接触到您的信息的工作人员采取严格授权原则，只有经我们授权的职员才能接触到您的个人资料, 这些职员需要遵守我们个人资料保密的内部守则。此外，我们不断对工作人员培训相关法律法规及隐私安全准则和安全意识强化宣导，并定期组织内部相关人员进行应急响应培训和应急演练，使其掌握岗位职责和应急处置策略和规程

6.1.4 技术措施：可能采用如Secure Socket Layer Encryption这种加密技术来输送您的个人资料。

6.1.5安全措施：为保障您的信息安全，我们致力于使用各种现行通用的安全技术及配套的管理体系来尽量降低您的信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。例如：通过网络安全层软件（SSL）进行加密传输、信息加密存储、严格限制数据中心的访问。传输和存储个人敏感信息（含个人生物识别信息）时，我们将采用加密、权限控制、去标识化、脱敏化等安全措施。

6.1.6其它措施：定期审查我们的个人资料收集，存储和处理流程; 并根据必要的原则限制我们的员工和供应商对您数据的访问权限，且我们的员工和供应商均需遵守严格的合同保密义务。

6.2 若您知悉我们的平台上有任何安全方面的漏洞, 请马上联系我们, 使我们可以尽快采取妥适的行动。

6.3 尽管实施了上述技术和保安的措施, 我们不能保证资料在互联网上的输送绝对安全, 因此我们不能绝对保证您通过我们平台提供给我们的个人资料在一切时候都是安全的。我们将不定期更新并公开安全风险、个人信息安全影响评估报告等有关内容，您可通过本平台公告方式获得。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """七、您如何管理自己的信息

7.1创建钱包

在使用本软件服务前，您必须先在平台上创建钱包。创建钱包的个人用户应当是年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人；欲创建钱包的法人、组织或其他机构，应当指定年满十八岁或根据其所在国法律规定具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人代表机构完成钱包创建。

7.2 设置钱包密码、私钥、助记词或Keystore

秉承着区块链的去中心化特点，并为了保护用户数字代币安全，本软件提供的是去中心化服务，区别于银行业金融机构。因此您需要自行牢记钱包密码（即用户创建/导入钱包时设置的密码）、私钥、助记词或Keystore，我们无法为您提供找回用户的钱包密码、私钥、助记词或Keystore；冻结钱包；挂失钱包；恢复钱包；或交易回滚服务

7.3 查询、更正和删除您的信息

您有权查询、更正或补充您的信息。如果您的任何个人数据不准确，您可以要求更新您的信息。

在以下情形中，您可以向我们提出删除个人信息的请求：

A. 如果我们处理个人信息的行为违反法律法规；

B. 如果我们收集、使用您的个人信息，却未征得您的明确同意；

C. 如果我们处理个人信息的行为严重违反了与您的约定；

D. 如果您不再使用我们的产品或服务，或您主动注销了账号；

E. 如果我们永久不再为您提供产品或服务。

若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，并要求其及时删除（除非法律法规另有规定，或这些主体已独立获得您的授权）。

当您或我们协助您删除相关信息后，因为适用的法律和安全技术，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名。

7.4妥善保管您的信息

您必须自行保管含有CASHBOX钱包的移动设备、备份CASHBOX钱包信息、备份钱包密码、助记词、私钥及Keystore。如您遗失移动设备、删除且未备份CASHBOX钱包信息、删除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词或Keystore，基于本服务的去中心化特征，您将无法还原钱包或找回钱包密码、私钥、助记词或Keystore。

7.5 约束信息系统自动决策

在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害CASHBOX钱包商业秘密或其他用户权益、社会公共利益的前提下提供申诉方法。

7.6 响应您的上述请求

为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。

我们将在15天内做出答复。如您不满意，还可以通过客服邮箱发起投诉。

在以下情形中，按照法律法规要求，我们将无法响应您的请求：

A. 与国家安全、国防安全有关的；

B. 与公共安全、公共卫生、重大公共利益有关的；

C. 与犯罪侦查、起诉、审判和执行判决等有关的；

D. 有充分证据表明个人信息主体存在主观恶意或滥用权利的；

E. 响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；

F.涉及商业秘密的。
          
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """
          八、您共享的信息

8.1您可以基于我们的服务与他人、社交网络分享您的相关信息，这其中可能包含您的个人身份信息、个人财产信息等敏感信息，并自主选择分享的对象作为能够看到您信息的第三方。

8.2当您与他人、社交网络或第三方服务提供商共享您的个人信息，或结合第三方的服务使用、或使用第三方的服务链接时，您可能会披露或使第三方获取您的个人信息。

8.3我们建议您查看此类社交网络或第三方服务提供商的隐私声明，以了解他们如何处理您的信息。对于您使用第三方服务时向其提供或与他人分享个人信息而产生的后果由您自行承担，并由相应责任方在法律规定范围内承担责任。

8.4当您在CASHBOX钱包软件上公开分享任何信息时，任何人都可能在使用CASHBOX钱包平台时查看或访问这些信息。您在使用我们服务时自愿共享的信息，可能会涉及您或他人的个人信息，请您谨慎选择并自行承担责任。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """
          九、未成年人保护

9.1 我们非常重视对未成年人个人信息的保护。根据相关法律法规的规定，若您是18周岁以下的未成年人，在使用CASHBOX钱包的服务前，应事先取得您的家长或法定监护人的同意。若您是未满14周岁的未成年人，您的监护人需要仔细阅读本政策并同意您依照本政策适用CASHBOX钱包软件。

9.2 我们不会主动直接向未成年人收集其个人信息。对于经监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、监护人同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。

9.3 如果有事实证明未成年人并未取得监护人同意的情况下注册使用了我们的产品与/或服务，我们会与相关监护人协商，并设法尽快删除相关个人信息。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """
          十、适用范围

我们的所有服务均适用本政策。但某些服务有其特定的隐私指引/声明，该特定隐私指引/声明更具体地说明我们在该服务中如何处理您的信息。如本政策与特定服务的隐私指引/声明有不一致之处，请以该特定隐私指引/声明为准。

请您注意，本政策不适用由其他公司或个人提供的服务。例如，您通过使用CASHBOX钱包帐号登录其他公司或个人提供的服务。

您使用该等第三方服务须受其隐私政策（而非本政策）约束，您需要仔细阅读其政策内容。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """
              十一、通知和修订

11.1 为给您提供更好的服务以及随着CASHBOX钱包业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在CASHBOX钱包官方网站、CASHBOX钱包移动端上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问CASHBOX钱包APP及时了解最新的隐私政策。

11.2 对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。

本隐私政策所指的重大变更包括但不限于：

A. 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；

B. 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；

C. 个人信息共享、转让或公开披露的主要对象发生变化；

D. 您参与个人信息处理方面的权利及其行使方式发生重大变化；

E. 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；

F. 个人信息安全影响评估报告表明存在高风险时。

11.3 我们还会将本隐私政策的旧版本存档，供您查阅。
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),
            TextSpan(
              text: """十二、如何联系我们
12.1如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请联系CASHBOX钱包客服。
官方客服邮箱:  CASHBOX@scry.info
          """,
              style: TextStyle(color: Colors.white, fontSize: ScreenUtil.instance.setSp(3), fontStyle: FontStyle.normal),
            ),
            TextSpan(text: '\n\n'),

          ])),
        ));
  }

  Widget _buildUserService() {
    return Container(
      child: SingleChildScrollView(
        child: Html(
          data: """<!DOCTYPE html>
<html>
<head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    <style type="text/css">
        body {
            background: url(../bg_graduate.png);
            background-size: 100% 100%;
            color: white;
        }
        ol {
            margin: 0;
            padding: 0
        }

        table td, table th {
            padding: 0
        }

        .c2 {
            font-weight: 400;
            text-decoration: none;
            vertical-align: baseline;
            font-size: 13.5pt;
            font-family: "Calibri";
            font-style: normal
        }

        .c7 {
            font-weight: 400;
            text-decoration: none;
            vertical-align: baseline;
            font-size: 10.5pt;
            font-family: "Calibri";
            font-style: normal
        }

        .c3 {
            padding-top: 0pt;
            padding-bottom: 0pt;
            line-height: 1.0;
            orphans: 2;
            widows: 2;
            text-align: justify
        }

        .c9 {
            padding-top: 0pt;
            padding-bottom: 0pt;
            line-height: 1.0;
            orphans: 2;
            widows: 2;
            text-align: right
        }

        .c1 {
            font-weight: 400;
            font-size: 13.5pt;
            font-family: "Calibri";
            font-style: normal
        }

        .c0 {
            font-weight: 400;
            font-size: 13.5pt;
            font-family: "\005b8b\004f53";
            font-style: normal
        }

        .c5 {
            padding-top: 0pt;
            padding-bottom: 0pt;
            line-height: 1.0;
            text-align: right;
            height: 10pt
        }

        .c4 {
            font-size: 13.5pt;
            font-family: "\005b8b\004f53";
            font-style: normal;
            font-weight: 400
        }

        .c8 {
            font-size: 13.5pt;
            font-family: "Calibri";
            font-style: normal;
            font-weight: 400
        }

        .c6 {
            padding: 0
        }

        .title {
            padding-top: 24pt;
            font-weight: 700;
            font-size: 36pt;
            padding-bottom: 6pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        .subtitle {
            padding-top: 18pt;
            font-size: 24pt;
            padding-bottom: 4pt;
            font-family: "Georgia";
            line-height: 1.0;
            page-break-after: avoid;
            font-style: italic;
            text-align: justify
        }

        li {
            font-size: 10.5pt;
            font-family: "Calibri"
        }

        p {
            margin: 0;
            font-size: 10.5pt;
            font-family: "Calibri"
        }

        h1 {
            padding-top: 24pt;
            font-weight: 700;
            font-size: 24pt;
            padding-bottom: 6pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        h2 {
            padding-top: 18pt;
            font-weight: 700;
            font-size: 18pt;
            padding-bottom: 4pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        h3 {
            padding-top: 14pt;
            font-weight: 700;
            font-size: 14pt;
            padding-bottom: 4pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        h4 {
            padding-top: 12pt;
            font-weight: 700;
            font-size: 12pt;
            padding-bottom: 2pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        h5 {
            padding-top: 11pt;
            font-weight: 700;
            font-size: 11pt;
            padding-bottom: 2pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }

        h6 {
            padding-top: 10pt;
            font-weight: 700;
            font-size: 10pt;
            padding-bottom: 2pt;
            font-family: "Calibri";
            line-height: 1.0;
            page-break-after: avoid;
            text-align: justify
        }</style>
</head>
<body class="c6"><p class="c3"><span class="c0">&#12298;</span><span class="c1">Scry Cashbox</span><span class="c0">&#38544;&#31169;&#25919;&#31574;&#12299;</span>
</p>
<p class="c3"><span class="c1">&nbsp;&nbsp;</span></p>
<p class="c3"><span class="c0">&#23562;&#25964;&#30340;&#29992;&#25143;&#65306;</span></p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c1">Scry Info Private Ltd.</span><span class="c0">&#65288;&#20197;&#19979;&#31616;&#31216;&ldquo;</span><span
        class="c1">Scry City</span><span class="c0">&rdquo;&#25110;&ldquo;&#25105;&#20204;&rdquo;&#65289;&#23562;&#37325;&#24182;&#20445;&#25252;&#29992;&#25143;&#65288;&#20197;&#19979;&#31616;&#31216;&ldquo;&#24744;&rdquo;&#25110;&ldquo;&#29992;&#25143;&rdquo;&#65289;&#30340;&#38544;&#31169;&#65292;&#24744;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#26102;&#65292;</span><span class="c1">Scry City</span><span
        class="c0">&#23558;&#25353;&#29031;&#26412;&#38544;&#31169;&#25919;&#31574;&#65288;&#20197;&#19979;&#31616;&#31216;&ldquo;&#26412;&#25919;&#31574;&rdquo;&#65289;&#25910;&#38598;&#12289;&#20351;&#29992;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c1">Scry City</span><span class="c0">&#24314;&#35758;&#24744;&#22312;&#20351;&#29992;&#26412;&#20135;&#21697;&#65288;&#20197;&#19979;&#31616;&#31216;&ldquo;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&rdquo;&#65289;&#20043;&#21069;&#20180;&#32454;&#38405;&#35835;&#24182;&#29702;&#35299;&#26412;&#25919;&#31574;&#20840;&#37096;&#20869;&#23481;</span><span
        class="c1">,&nbsp;</span><span class="c0">&#38024;&#23545;&#20813;&#36131;&#22768;&#26126;&#31561;&#26465;&#27454;&#22312;&#20869;&#30340;&#37325;&#35201;&#20449;&#24687;&#23558;&#20197;&#21152;&#31895;&#30340;&#24418;&#24335;&#20307;&#29616;&#12290;&#26412;&#25919;&#31574;&#26377;&#20851;&#20851;&#38190;&#35789;&#23450;&#20041;&#19982;</span><span
        class="c1">Scry City</span><span class="c0">&#12298;</span><span class="c1">Scry Cashbox</span><span class="c0">&#26381;&#21153;&#21327;&#35758;&#12299;&#20445;&#25345;&#19968;&#33268;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#26412;&#25919;&#31574;&#21487;&#30001;</span><span class="c1">Scry City</span><span
        class="c0">&#22312;&#32447;&#38543;&#26102;&#26356;&#26032;&#65292;&#26356;&#26032;&#21518;&#30340;&#25919;&#31574;&#19968;&#26086;&#20844;&#24067;&#21363;&#20195;&#26367;&#21407;&#26469;&#30340;&#25919;&#31574;&#65292;&#22914;&#26524;&#24744;&#19981;&#25509;&#21463;&#20462;&#25913;&#21518;&#30340;&#26465;&#27454;&#65292;&#35831;&#31435;&#21363;&#20572;&#27490;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#65292;&#24744;&#32487;&#32493;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#23558;&#34987;&#35270;&#20026;&#25509;&#21463;&#20462;&#25913;&#21518;&#30340;&#25919;&#31574;&#12290;&#32463;&#20462;&#25913;&#30340;&#25919;&#31574;&#19968;&#32463;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#19978;&#20844;&#24067;&#65292;&#31435;&#21363;&#33258;&#21160;&#29983;&#25928;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#24744;&#30693;&#24713;&#26412;&#25919;&#31574;&#21450;&#20854;&#20182;&#26377;&#20851;&#35268;&#23450;&#36866;&#29992;&#20110;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#21450;</span><span class="c1">Scry Cashbox</span><span
        class="c0">&#19978;</span><span class="c1">Scry City</span><span class="c0">&#25152;&#33258;&#20027;&#25317;&#26377;&#30340;</span><span
        class="c1">DApp</span><span class="c0">&#12290;</span></p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#19968;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#25105;&#20204;&#25910;&#38598;&#24744;&#30340;&#21738;&#20123;&#20449;&#24687;</span>
</p>
<p class="c3"><span class="c0">&#35831;&#24744;&#30693;&#24713;&#65292;&#25105;&#20204;&#25910;&#38598;&#24744;&#30340;&#20197;&#19979;&#20449;&#24687;&#26159;&#20986;&#20110;&#28385;&#36275;&#24744;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#26381;&#21153;&#38656;&#35201;&#30340;&#30446;&#30340;&#65292;&#19988;&#25105;&#20204;&#21313;&#20998;&#37325;&#35270;&#23545;&#24744;&#38544;&#31169;&#30340;&#20445;&#25252;&#12290;&#22312;&#25105;&#20204;&#25910;&#38598;&#24744;&#30340;&#20449;&#24687;&#26102;&#65292;&#23558;&#20005;&#26684;&#36981;&#23432;&ldquo;&#21512;&#27861;&#12289;&#27491;&#24403;&#12289;&#24517;&#35201;&rdquo;&#30340;&#21407;&#21017;&#12290;&#19988;&#24744;&#30693;&#24713;&#65292;&#33509;&#24744;&#19981;&#25552;&#20379;&#25105;&#20204;&#26381;&#21153;&#25152;&#38656;&#30340;&#30456;&#20851;&#20449;&#24687;&#65292;&#24744;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#30340;&#26381;&#21153;&#20307;&#39564;&#21487;&#33021;&#22240;&#27492;&#32780;&#21463;&#21040;&#24433;&#21709;&#12290;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#25105;&#20204;&#23558;&#25910;&#38598;&#24744;&#30340;&#31227;&#21160;&#35774;&#22791;&#20449;&#24687;&#12289;&#25805;&#20316;&#35760;&#24405;&#12289;&#20132;&#26131;&#35760;&#24405;&#12289;&#38065;&#21253;&#22320;&#22336;&#31561;&#20010;&#20154;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#20026;&#28385;&#36275;&#24744;&#30340;&#29305;&#23450;&#26381;&#21153;&#38656;&#27714;&#65292;&#25105;&#20204;&#23558;&#25910;&#38598;&#24744;&#30340;&#22995;&#21517;&#12289;&#38134;&#34892;&#21345;&#21495;&#12289;&#25163;&#26426;&#21495;&#30721;&#12289;&#37038;&#20214;&#22320;&#22336;&#31561;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">3.&nbsp;</span><span
        class="c0">&#24744;&#30693;&#24713;&#65306;&#24744;&#22312;</span><span
        class="c1">Scry Cashbox&nbsp;</span><span class="c0">&#19978;&#30340;&#38065;&#21253;&#23494;&#30721;&#12289;&#31169;&#38053;&#12289;&#21161;&#35760;&#35789;&#12289;</span><span
        class="c1">Keystore</span><span
        class="c0">&#24182;&#19981;&#23384;&#20648;&#25110;&#21516;&#27493;&#33267;</span><span
        class="c1">Scry City</span><span class="c0">&#26381;&#21153;&#22120;&#12290;</span><span
        class="c1">Scry City</span><span class="c0">&#19981;&#25552;&#20379;&#25214;&#22238;&#24744;&#30340;&#38065;&#21253;&#23494;&#30721;&#12289;&#31169;&#38053;&#12289;&#21161;&#35760;&#35789;&#12289;</span><span
        class="c1">Keystore</span><span class="c0">&#30340;&#26381;&#21153;&#12290;</span></p>
<p class="c3"><span class="c1">4.&nbsp;</span><span class="c0">&#38500;&#19978;&#36848;&#20869;&#23481;&#20043;&#22806;&#65292;&#24744;&#30693;&#24713;&#22312;&#24744;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox Wallet</span><span class="c0">&#29305;&#23450;&#21151;&#33021;&#26102;&#65292;&#25105;&#20204;&#23558;&#22312;&#25910;&#38598;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#21069;&#21521;&#24744;&#20316;&#20986;&#29305;&#21035;&#25552;&#31034;&#65292;&#35201;&#27714;&#21521;&#24744;&#25910;&#38598;&#26356;&#22810;&#30340;&#20010;&#20154;&#20449;&#24687;&#12290;&#22914;&#24744;&#36873;&#25321;&#19981;&#21516;&#24847;&#65292;&#21017;&#35270;&#20026;&#24744;&#25918;&#24323;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#35813;&#29305;&#23450;&#21151;&#33021;&#12290;</span></p>
<p class="c3"><span class="c1">5.&nbsp;</span><span class="c0">&#24403;&#24744;&#36339;&#36716;&#21040;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#21518;&#65292;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#20250;&#21521;&#24744;&#25910;&#38598;&#20010;&#20154;&#20449;&#24687;&#12290;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#19981;&#25345;&#26377;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#21521;&#24744;&#25910;&#38598;&#30340;&#20010;&#20154;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">6.&nbsp;</span><span class="c0">&#22312;&#27861;&#24459;&#27861;&#35268;&#20801;&#35768;&#30340;&#33539;&#22260;&#20869;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#21487;&#33021;&#20250;&#22312;&#20197;&#19979;&#24773;&#24418;&#20013;&#25910;&#38598;&#24182;&#20351;&#29992;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#26080;&#38656;&#24449;&#24471;&#24744;&#30340;&#25480;&#26435;&#21516;&#24847;&#65306;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">1</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#19982;&#22269;&#23478;&#23433;&#20840;&#12289;&#22269;&#38450;&#23433;&#20840;&#26377;&#20851;&#30340;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">2</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#19982;&#20844;&#20849;&#23433;&#20840;&#12289;&#20844;&#20849;&#21355;&#29983;&#12289;&#37325;&#22823;&#20844;&#20849;&#21033;&#30410;&#26377;&#20851;&#30340;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">3</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#19982;&#29359;&#32618;&#20390;&#26597;&#12289;&#36215;&#35785;&#12289;&#23457;&#21028;&#21644;&#21028;&#20915;&#25191;&#34892;&#31561;&#26377;&#20851;&#30340;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">4</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#25152;&#25910;&#38598;&#30340;&#20010;&#20154;&#20449;&#24687;&#26159;&#24744;&#33258;&#34892;&#21521;&#31038;&#20250;&#20844;&#20247;&#20844;&#24320;&#30340;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">5</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#20174;&#21512;&#27861;&#20844;&#24320;&#25259;&#38706;&#30340;&#20449;&#24687;&#20013;&#25910;&#38598;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#65292;&#22914;&#21512;&#27861;&#30340;&#26032;&#38395;&#25253;&#36947;&#65292;&#25919;&#24220;&#20449;&#24687;&#20844;&#24320;&#31561;&#28192;&#36947;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">6</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#29992;&#20110;&#32500;&#25252;&#26381;&#21153;&#30340;&#23433;&#20840;&#21644;&#21512;&#35268;&#25152;&#24517;&#38656;&#30340;&#65292;&#20363;&#22914;&#21457;&#29616;&#12289;&#22788;&#29702;&#20135;&#21697;&#21644;&#26381;&#21153;&#30340;&#25925;&#38556;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">7</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#27861;&#24459;&#27861;&#35268;&#35268;&#23450;&#30340;&#20854;&#20182;&#24773;&#24418;&#12290;</span>
</p>
<p class="c3"><span class="c1">7.&nbsp;</span><span class="c0">&#25105;&#20204;&#25910;&#38598;&#20449;&#24687;&#30340;&#26041;&#24335;&#22914;&#19979;&#65306;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">1</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#24744;&#21521;&#25105;&#20204;&#25552;&#20379;&#20449;&#24687;&#12290;&#20363;&#22914;&#65292;&#24744;&#22312;&ldquo;&#20010;&#20154;&#20013;&#24515;&rdquo;&#39029;&#38754;&#20013;&#22635;&#20889;&#22995;&#21517;&#12289;&#25163;&#26426;&#21495;&#30721;&#25110;&#38134;&#34892;&#21345;&#21495;&#65292;&#25110;&#22312;&#21453;&#39304;&#38382;&#39064;&#26102;&#25552;&#20379;&#37038;&#20214;&#22320;&#22336;&#65292;&#25110;&#22312;&#20351;&#29992;&#25105;&#20204;&#30340;&#29305;&#23450;&#26381;&#21153;&#26102;&#65292;&#24744;&#39069;&#22806;&#21521;&#25105;&#20204;&#25552;&#20379;&#12290;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">2</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#25105;&#20204;&#22312;&#24744;&#20351;&#29992;</span><span class="c1">Scry Cashbox</span><span
        class="c0">&#30340;&#36807;&#31243;&#20013;&#33719;&#21462;&#20449;&#24687;&#65292;&#21253;&#25324;&#24744;&#31227;&#21160;&#35774;&#22791;&#20449;&#24687;&#20197;&#21450;&#24744;&#23545;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#30340;&#25805;&#20316;&#35760;&#24405;&#31561;&#20449;&#24687;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">3</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#25105;&#20204;&#36890;&#36807;&#21306;&#22359;&#38142;&#31995;&#32479;&#65292;&#25335;&#36125;&#24744;&#20840;&#37096;&#25110;&#37096;&#20998;&#30340;&#20132;&#26131;&#35760;&#24405;&#12290;&#20294;&#20132;&#26131;&#35760;&#24405;&#20197;&#21306;&#22359;&#38142;&#31995;&#32479;&#30340;&#35760;&#36733;&#20026;&#20934;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#20108;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#25105;&#20204;&#22914;&#20309;&#20351;&#29992;&#24744;&#30340;&#20449;&#24687;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#25105;&#20204;&#36890;&#36807;&#24744;&#31227;&#21160;&#35774;&#22791;&#30340;&#21807;&#19968;&#24207;&#21015;&#21495;&#65292;&#30830;&#35748;&#24744;&#19982;&#24744;&#30340;&#38065;&#21253;&#30340;&#23545;&#24212;&#20851;&#31995;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#25105;&#20204;&#23558;&#21521;&#24744;&#21450;&#26102;&#21457;&#36865;&#37325;&#35201;&#36890;&#30693;&#65292;&#22914;&#36719;&#20214;&#26356;&#26032;&#12289;&#26381;&#21153;&#21327;&#35758;&#21450;&#26412;&#25919;&#31574;&#26465;&#27454;&#30340;&#21464;&#26356;&#12290;</span>
</p>
<p class="c3"><span class="c1">3.&nbsp;</span><span class="c0">&#25105;&#20204;&#22312;</span><span class="c1">Scry Cashbox</span><span
        class="c0">&#30340;&ldquo;&#31995;&#32479;&#35774;&#32622;&rdquo;&#20013;&#20026;&#24744;&#25552;&#20379;&ldquo;&#25351;&#32441;&#30331;&#24405;&rdquo;&#36873;&#39033;&#65292;&#35753;&#24744;&#26041;&#20415;&#19988;&#26356;&#23433;&#20840;&#22320;&#31649;&#29702;&#24744;&#30340;&#25968;&#23383;&#20195;&#24065;&#12290;</span>
</p>
<p class="c3"><span class="c1">4.&nbsp;</span><span class="c0">&#25105;&#20204;&#36890;&#36807;&#25910;&#38598;&#24744;&#20844;&#24320;&#30340;&#38065;&#21253;&#22320;&#22336;&#21644;&#25552;&#20379;&#30340;&#31227;&#21160;&#35774;&#22791;&#20449;&#24687;&#26469;&#22788;&#29702;&#24744;&#21521;&#25105;&#20204;&#25552;&#20132;&#30340;&#21453;&#39304;&#12290;</span>
</p>
<p class="c3"><span class="c1">5.&nbsp;</span><span class="c0">&#25105;&#20204;&#25910;&#38598;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#36827;&#34892;</span><span
        class="c1">Scry City</span><span class="c0">&#20869;&#37096;&#23457;&#35745;&#12289;&#25968;&#25454;&#20998;&#26512;&#21644;&#30740;&#31350;&#31561;&#65292;&#20197;&#26399;&#19981;&#26029;&#25552;&#21319;&#25105;&#20204;&#30340;&#26381;&#21153;&#27700;&#24179;&#12290;</span>
</p>
<p class="c3"><span class="c1">6.&nbsp;</span><span class="c0">&#20381;&#29031;&#12298;</span><span class="c1">Scry Cashbox</span><span
        class="c0">&#26381;&#21153;&#21327;&#35758;&#12299;&#21450;</span><span class="c1">Scry City</span><span
        class="c0">&#20854;&#20182;&#26377;&#20851;&#35268;&#23450;&#65292;</span><span class="c1">Scry City</span><span
        class="c0">&#23558;&#21033;&#29992;&#29992;&#25143;&#20449;&#24687;&#23545;&#29992;&#25143;&#30340;&#20351;&#29992;&#34892;&#20026;&#36827;&#34892;&#31649;&#29702;&#21450;&#22788;&#29702;&#12290;</span>
</p>
<p class="c3"><span class="c1">7.&nbsp;</span><span class="c0">&#27861;&#24459;&#27861;&#35268;&#35268;&#23450;&#21450;&#19982;&#30417;&#31649;&#26426;&#26500;&#37197;&#21512;&#30340;&#35201;&#27714;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#19977;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#24744;&#22914;&#20309;&#25511;&#21046;&#33258;&#24049;&#30340;&#20449;&#24687;</span>
</p>
<p class="c3"><span class="c0">&#24744;&#22312;</span><span class="c1">Scry Cashbox</span><span class="c0">&#20013;&#25317;&#26377;&#20197;&#19979;&#23545;&#24744;&#20010;&#20154;&#20449;&#24687;&#33258;&#20027;&#25511;&#21046;&#26435;&#65306;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#24744;&#21487;&#20197;&#36890;&#36807;&#21516;&#27493;&#38065;&#21253;&#30340;&#26041;&#24335;&#65292;&#23558;&#24744;&#30340;&#20854;&#20182;&#38065;&#21253;&#23548;&#20837;</span><span
        class="c1">Scry Cashbox</span><span
        class="c0">&#20013;&#65292;&#25110;&#32773;&#23558;&#24744;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#30340;&#38065;&#21253;&#23548;&#20837;&#21040;&#20854;&#20182;&#25968;&#23383;&#20195;&#24065;&#31649;&#29702;&#38065;&#21253;&#20013;&#12290;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#23558;&#21521;&#24744;&#26174;&#31034;&#23548;&#20837;&#38065;&#21253;&#30340;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#24744;&#30693;&#24713;&#24744;&#21487;&#20197;&#20462;&#25913;&#24744;&#30340;&#25968;&#23383;&#20195;&#24065;&#31181;&#31867;&#12289;&#36827;&#34892;&#36716;&#36134;&#21450;&#25910;&#27454;&#31561;&#27963;&#21160;&#12290;</span>
</p>
<p class="c3"><span class="c1">3.&nbsp;</span><span class="c0">&#24744;&#30693;&#24713;&#24403;&#25105;&#20204;&#20986;&#20110;&#29305;&#23450;&#30446;&#30340;&#21521;&#24744;&#25910;&#38598;&#20449;&#24687;&#26102;&#65292;&#25105;&#20204;&#20250;&#25552;&#21069;&#32473;&#20104;&#24744;&#36890;&#30693;&#65292;&#24744;&#26377;&#26435;&#36873;&#25321;&#25298;&#32477;&#12290;&#20294;&#21516;&#26102;&#24744;&#30693;&#24713;&#65292;&#24403;&#24744;&#36873;&#25321;&#25298;&#32477;&#25552;&#20379;&#26377;&#20851;&#20449;&#24687;&#26102;&#65292;&#21363;&#34920;&#31034;&#24744;&#25918;&#24323;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#30340;&#26377;&#20851;&#26381;&#21153;&#12290;</span></p>
<p class="c3"><span class="c1">4.&nbsp;</span><span class="c0">&#24744;&#30693;&#24713;&#65292;&#24744;&#21450;&#25105;&#20204;&#23545;&#20110;&#24744;&#20132;&#26131;&#35760;&#24405;&#26159;&#21542;&#20844;&#24320;&#24182;&#27809;&#26377;&#25511;&#21046;&#26435;&#65292;&#22240;&#20026;&#22522;&#20110;&#21306;&#22359;&#38142;&#20132;&#26131;&#31995;&#32479;&#30340;&#24320;&#28304;&#23646;&#24615;&#65292;&#24744;&#30340;&#20132;&#26131;&#35760;&#24405;&#22312;&#25972;&#20010;&#21306;&#22359;&#38142;&#31995;&#32479;&#20013;&#20844;&#24320;&#36879;&#26126;&#12290;</span>
</p>
<p class="c3"><span class="c1">5.&nbsp;</span><span
        class="c0">&#24744;&#30693;&#24713;&#24403;&#24744;&#20351;&#29992;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#30340;&#21151;&#33021;&#36339;&#36716;&#33267;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#20043;&#21518;&#65292;&#25105;&#20204;&#30340;&#12298;</span><span
        class="c1">Scry Cashbox</span><span
        class="c0">&#26381;&#21153;&#21327;&#35758;&#12299;&#12289;&#12298;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#38544;&#31169;&#25919;&#31574;&#12299;&#23558;&#19981;&#20877;&#36866;&#29992;&#65292;&#38024;&#23545;&#24744;&#22312;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#19978;&#23545;&#24744;&#20010;&#20154;&#20449;&#24687;&#30340;&#25511;&#21046;&#26435;&#38382;&#39064;&#65292;&#25105;&#20204;&#24314;&#35758;&#24744;&#22312;&#20351;&#29992;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#20043;&#21069;&#35814;&#32454;&#38405;&#35835;&#24182;&#20102;&#35299;&#20854;&#38544;&#31169;&#35268;&#21017;&#21644;&#26377;&#20851;&#29992;&#25143;&#26381;&#21153;&#21327;&#35758;&#31561;&#20869;&#23481;&#12290;</span>
</p>
<p class="c3"><span class="c1">6.&nbsp;</span><span class="c0">&#24744;&#26377;&#26435;&#35201;&#27714;&#25105;&#20204;&#26356;&#26032;&#12289;&#26356;&#25913;&#12289;&#21024;&#38500;&#24744;&#30340;&#26377;&#20851;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">7.&nbsp;</span><span class="c0">&#24744;&#30693;&#24713;&#25105;&#20204;&#21487;&#20197;&#26681;&#25454;&#26412;&#25919;&#31574;&#31532;&#19968;&#26465;&#31532;</span><span
        class="c1">6</span><span class="c0">&#27454;&#30340;&#35201;&#27714;&#25910;&#38598;&#24744;&#30340;&#20449;&#24687;&#32780;&#26080;&#38656;&#33719;&#24471;&#24744;&#30340;&#25480;&#26435;&#21516;&#24847;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#22235;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#25105;&#20204;&#21487;&#33021;&#20998;&#20139;&#25110;&#20256;&#36755;&#24744;&#30340;&#20449;&#24687;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#33509;</span><span class="c1">Scry City</span><span
        class="c0">&#38656;&#21521;&#22659;&#22806;&#20256;&#36755;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#65292;&#23558;&#22312;&#20107;&#21069;&#33719;&#24471;&#24744;&#30340;&#25480;&#26435;&#65292;&#19988;&#25353;&#29031;&#26377;&#20851;&#27861;&#24459;&#27861;&#35268;&#25919;&#31574;&#30340;&#35201;&#27714;&#36827;&#34892;&#25968;&#25454;&#20256;&#36755;&#65292;&#24182;&#23545;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#23653;&#34892;&#20445;&#23494;&#20041;&#21153;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#26410;&#32463;&#24744;&#20107;&#20808;&#21516;&#24847;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#19981;&#20250;&#23558;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#21521;&#20219;&#20309;&#31532;&#19977;&#26041;&#20849;&#20139;&#25110;&#36716;&#35753;&#65292;&#20294;&#20197;&#19979;&#24773;&#20917;&#38500;&#22806;&#65306;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">1</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#20107;&#20808;&#33719;&#24471;&#24744;&#26126;&#30830;&#30340;&#21516;&#24847;&#25110;&#25480;&#26435;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">2</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#25152;&#25910;&#38598;&#30340;&#20010;&#20154;&#20449;&#24687;&#26159;&#24744;&#33258;&#34892;&#21521;&#31038;&#20250;&#20844;&#20247;&#20844;&#24320;&#30340;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">3</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#25152;&#25910;&#38598;&#30340;&#20010;&#20154;&#20449;&#24687;&#31995;&#20174;&#21512;&#27861;&#20844;&#24320;&#25259;&#38706;&#30340;&#20449;&#24687;&#20013;&#25910;&#38598;&#65292;&#22914;&#21512;&#27861;&#30340;&#26032;&#38395;&#25253;&#36947;&#65292;&#25919;&#24220;&#20449;&#24687;&#20844;&#24320;&#31561;&#28192;&#36947;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">4</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#19982;</span><span class="c1">Scry City</span><span class="c0">&#30340;&#20851;&#32852;&#26041;&#20849;&#20139;&#65292;&#25105;&#20204;&#21482;&#20250;&#20849;&#20139;&#24517;&#35201;&#30340;&#29992;&#25143;&#20449;&#24687;&#65292;&#19988;&#21463;&#26412;&#38544;&#31169;&#26465;&#27454;&#20013;&#25152;&#22768;&#26126;&#30340;&#30446;&#30340;&#30340;&#32422;&#26463;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">5</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#26681;&#25454;&#36866;&#29992;&#30340;&#27861;&#24459;&#27861;&#35268;&#12289;&#27861;&#24459;&#31243;&#24207;&#30340;&#35201;&#27714;&#12289;&#34892;&#25919;&#26426;&#20851;&#25110;&#21496;&#27861;&#26426;&#20851;&#30340;&#35201;&#27714;&#36827;&#34892;&#25552;&#20379;&#65307;</span>
</p>
<p class="c3"><span class="c0">&#65288;</span><span class="c1">6</span><span class="c0">&#65289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#22312;&#28041;&#21450;&#21512;&#24182;&#12289;&#25910;&#36141;&#26102;&#65292;&#22914;&#28041;&#21450;&#21040;&#20010;&#20154;&#20449;&#24687;&#36716;&#35753;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#23558;&#35201;&#27714;&#20010;&#20154;&#20449;&#24687;&#25509;&#25910;&#26041;&#32487;&#32493;&#25509;&#21463;&#26412;&#25919;&#31574;&#30340;&#32422;&#26463;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#20116;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#25105;&#20204;&#22914;&#20309;&#20445;&#25252;&#24744;&#30340;&#20449;&#24687;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#22914;</span><span class="c1">Scry City</span><span
        class="c0">&#20572;&#27490;&#36816;&#33829;&#65292;</span><span class="c1">Scry City</span><span class="c0">&#23558;&#21450;&#26102;&#20572;&#27490;&#32487;&#32493;&#25910;&#38598;&#24744;&#20010;&#20154;&#20449;&#24687;&#30340;&#27963;&#21160;&#65292;&#23558;&#20572;&#27490;&#36816;&#33829;&#30340;&#36890;&#30693;&#20844;&#21578;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#19978;&#65292;&#24182;&#23545;&#25152;&#25345;&#26377;&#30340;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#22312;&#21512;&#29702;&#26399;&#38480;&#20869;&#36827;&#34892;&#21024;&#38500;&#25110;&#21311;&#21517;&#21270;&#22788;&#29702;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#20026;&#20102;&#20445;&#25252;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#23558;&#37319;&#21462;&#25968;&#25454;&#23433;&#20840;&#25216;&#26415;&#25514;&#26045;&#65292;&#25552;&#21319;&#20869;&#37096;&#21512;&#35268;&#27700;&#24179;&#65292;&#22686;&#21152;&#20869;&#37096;&#21592;&#24037;&#20449;&#24687;&#23433;&#20840;&#22521;&#35757;&#65292;&#24182;&#23545;&#30456;&#20851;&#25968;&#25454;&#35774;&#32622;&#23433;&#20840;&#35775;&#38382;&#26435;&#38480;&#31561;&#26041;&#24335;&#23433;&#20840;&#20445;&#25252;&#24744;&#30340;&#38544;&#31169;&#20449;&#24687;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;&nbsp;</span></p>
<p class="c3"><span class="c0">&#20845;&#12289;</span><span class="c1">&nbsp;</span><span class="c0">&#20813;&#36131;&#22768;&#26126;</span>
</p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#35831;&#24744;&#27880;&#24847;&#65292;&#24744;&#36890;&#36807;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#25509;&#20837;&#31532;&#19977;&#26041;</span><span class="c1">DApp</span><span
        class="c0">&#21518;&#65292;&#23558;&#36866;&#29992;&#35813;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#21457;&#24067;&#30340;&#38544;&#31169;&#25919;&#31574;&#12290;&#35813;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#23545;&#24744;&#20010;&#20154;&#20449;&#24687;&#30340;&#25910;&#38598;&#21644;&#20351;&#29992;&#19981;&#20026;</span><span
        class="c1">Scry City</span><span class="c0">&#25152;&#25511;&#21046;&#65292;&#20063;&#19981;&#21463;&#26412;&#25919;&#31574;&#30340;&#32422;&#26463;&#12290;</span><span
        class="c1">Scry City</span><span class="c0">&#26080;&#27861;&#20445;&#35777;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#19968;&#23450;&#20250;&#25353;&#29031;</span><span
        class="c1">Scry City</span><span class="c0">&#30340;&#35201;&#27714;&#37319;&#21462;&#20010;&#20154;&#20449;&#24687;&#20445;&#25252;&#25514;&#26045;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#24744;&#24212;&#23457;&#24910;&#36873;&#25321;&#21644;&#20351;&#29992;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#65292;&#24182;&#22949;&#21892;&#20445;&#25252;&#22909;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#23545;&#20854;&#20182;&#31532;&#19977;&#26041;</span><span
        class="c1">DApp</span><span class="c0">&#30340;&#38544;&#31169;&#20445;&#25252;&#19981;&#36127;&#20219;&#20309;&#36131;&#20219;&#12290;</span>
</p>
<p class="c3"><span class="c1">3.&nbsp;Scry City</span><span class="c0">&#23558;&#22312;&#29616;&#26377;&#25216;&#26415;&#27700;&#24179;&#26465;&#20214;&#19979;&#23613;&#21487;&#33021;&#37319;&#21462;&#21512;&#29702;&#30340;&#23433;&#20840;&#25514;&#26045;&#26469;&#20445;&#25252;&#24744;&#30340;&#20010;&#20154;&#20449;&#24687;&#65292;&#20197;&#36991;&#20813;&#20449;&#24687;&#30340;&#27844;&#38706;&#12289;&#31713;&#25913;&#25110;&#32773;&#27585;&#25439;&#12290;</span><span
        class="c1">Scry City</span><span class="c0">&#31995;&#21033;&#29992;&#26080;&#32447;&#26041;&#24335;&#20256;&#36755;&#25968;&#25454;&#65292;&#22240;&#27492;&#65292;</span><span
        class="c1">Scry City</span><span class="c0">&#26080;&#27861;&#30830;&#20445;&#36890;&#36807;&#26080;&#32447;&#32593;&#32476;&#20256;&#36755;&#25968;&#25454;&#30340;&#38544;&#31169;&#24615;&#21644;&#23433;&#20840;&#24615;&#12290;</span>
</p>
<p class="c3"><span class="c1">&nbsp;</span></p>
<p class="c3"><span class="c0">&#19971;&#12289;</span><span class="c1">&nbsp;</span><span
        class="c0">&#20854;&#20182;</span></p>
<p class="c3"><span class="c1">1.&nbsp;</span><span class="c0">&#24744;&#22312;&#20351;&#29992;</span><span class="c1">Scry City</span><span
        class="c0">&#26381;&#21153;&#36807;&#31243;&#20013;&#65292;&#22914;&#36935;&#21040;&#20219;&#20309;&#26377;&#20851;&#20010;&#20154;&#20449;&#24687;&#20351;&#29992;&#30340;&#38382;&#39064;&#65292;&#24744;&#21487;&#20197;&#36890;&#36807;&#22312;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#25552;&#20132;&#21453;&#39304;&#31561;&#26041;&#24335;&#32852;&#31995;&#25105;&#20204;&#12290;</span>
</p>
<p class="c3"><span class="c1">2.&nbsp;</span><span class="c0">&#24744;&#21487;&#20197;&#22312;</span><span class="c1">Scry Cashbox</span><span
        class="c0">&#20013;&#26597;&#30475;&#26412;&#25919;&#31574;&#21450;</span><span class="c1">Scry City</span><span
        class="c0">&#20854;&#20182;&#26381;&#21153;&#35268;&#21017;&#12290;&#25105;&#20204;&#40723;&#21169;&#24744;&#22312;&#27599;&#27425;&#35775;&#38382;</span><span
        class="c1">Scry Cashbox</span><span class="c0">&#26102;&#37117;&#26597;&#38405;</span><span
        class="c1">Scry City</span><span class="c0">&#30340;&#26381;&#21153;&#21327;&#35758;&#21450;&#38544;&#31169;&#25919;&#31574;&#12290;</span>
</p>
<p class="c3"><span class="c1">3.&nbsp;</span><span class="c0">&#26412;&#25919;&#31574;&#30340;&#20219;&#20309;&#35793;&#25991;&#29256;&#26412;&#20165;&#20026;&#26041;&#20415;&#29992;&#25143;&#32780;&#25552;&#20379;&#65292;&#26080;&#24847;&#23545;&#26412;&#25919;&#31574;&#30340;&#26465;&#27454;&#36827;&#34892;&#20462;&#25913;&#12290;&#22914;&#26524;&#26412;&#25919;&#31574;&#30340;&#20013;&#25991;&#29256;&#26412;&#19982;&#38750;&#20013;&#25991;&#29256;&#26412;&#20043;&#38388;&#23384;&#22312;&#20914;&#31361;&#65292;&#24212;&#20197;&#20013;&#25991;&#29256;&#26412;&#20026;&#20934;&#12290;</span>
</p>
<p class="c3"><span class="c1">4.&nbsp;</span><span class="c0">&#26412;&#25919;&#31574;&#33258;</span><span class="c8">2018</span><span
        class="c4">&#24180;</span><span class="c8">6</span><span class="c4">&#26376;</span><span
        class="c8">9</span><span class="c4">&#26085;</span><span class="c0">&#36215;&#36866;&#29992;&#12290;</span></p>
<p class="c3" id="h.gjdgxs"><span class="c0">&#26412;&#25919;&#31574;&#26410;&#23613;&#20107;&#23452;&#65292;&#24744;&#38656;&#36981;&#23432;</span><span
        class="c1">Scry City</span><span class="c0">&#19981;&#26102;&#26356;&#26032;&#30340;&#20844;&#21578;&#21450;&#30456;&#20851;&#35268;&#21017;&#12290;</span>
</p>
<p class="c5"><span class="c7"></span></p>
<p class="c9"><span class="c1">Scry Info Private Ltd.</span></p>
<p class="c5"><span class="c7"></span></p></body>
</html>
""",
          padding: EdgeInsets.all(8.0),
          defaultTextStyle: TextStyle(fontFamily: 'serif', color: Colors.white70),
          linkStyle: const TextStyle(
            color: Colors.redAccent,
          ),
          onLinkTap: (url) {
            // open url in a webview
          },
        ),
      ),
    );
  }
}
